In [1]:
import pandas as pd

In [5]:
friend_list = [
                    ['name',['John','Jenny','Nate']],
                    ['age',[20,30,30]],
                    ['job',['student','developer','teacher']]
               ]

df = pd.DataFrame.from_dict(dict(friend_list))

In [6]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
# list에 인덱스를 주면 마지막 인덱스는 포함하지 않음
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
# 결과값을 적용하고 싶을 때 결과를 다시 데이터프레임에 넣어야함
df = df[1:3]

In [10]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
friend_list = [
                    ['name',['John','Jenny','Nate']],
                    ['age',[20,30,30]],
                    ['job',['student','developer','teacher']]
               ]

df = pd.DataFrame.from_dict(dict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [12]:
# Jenny를 제외하고 싶을 때
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [14]:
df = df.loc[[0,2]]
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [15]:
friend_list = [
                    ['name',['John','Jenny','Nate']],
                    ['age',[20,30,30]],
                    ['job',['student','developer','teacher']]
               ]

df = pd.DataFrame.from_dict(dict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by column condition

In [16]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [18]:
df[ (df.age>25) & (df.name == 'Nate') ]

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [21]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]

df= pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [22]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [23]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [25]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [27]:
df_filtered = df[['name', 'age']]

In [28]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [29]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [30]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [31]:
# column name 중에 'a'가 포함된 것 찾기
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [32]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [33]:
# 정규표현식 적용, column name이 b로 끝나는 column 찾기
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern